Тест/Тест/src/Documents/ВыходТоваровИзАкции10/ВыходТоваровИзАкции10.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыходТоваровИзАкции10</name>
  <registerRecords>AccumulationRegister.РегистрАкция10</registerRecords>
  <attributes>
    <name>НаименованиеАкции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАкции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ИндКод</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаАкция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРек</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Машина</name>
      <type>
        <types>CatalogRef.Машины</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/AccumulationRegisters/РегистрАкция10/РегистрАкция10.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РегистрАкция10</name>
  <resources>
    <name>Колво</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаРек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/Documents/ВыходТоваровИзАкции10/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
//======================================================================================================================

Движения.РегистрАкция10.Записывать = Истина;
Движения.Записать();
Движения.РегистрАкция10.Записывать = Истина;

Счетчик = 0; 
Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыходТоваровИзАкции10.Номенклатура,
	|	ВыходТоваровИзАкции10.Партия,
	|	ВыходТоваровИзАкции10.Количество,
	|	ВыходТоваровИзАкции10.ЦенаАкция,
	|	ВыходТоваровИзАкции10.Склад,
	|	ВыходТоваровИзАкции10.Машина,
	|	ВыходТоваровИзАкции10.ЦенаРек
	|ПОМЕСТИТЬ ВТ_Выход
	|ИЗ
	|	Документ.ВыходТоваровИзАкции10.Товары КАК ВыходТоваровИзАкции10
	|ГДЕ
	|	ВыходТоваровИзАкции10.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Выход.Номенклатура,
	|	ВТ_Выход.Партия,
	|	ВТ_Выход.Количество,
	|	ВТ_Выход.ЦенаАкция,
	|	ВТ_Выход.Склад,
	|	ВТ_Выход.Машина,
	|	РегистрАкция10Остатки.КолвоОстаток,
	|	ВТ_Выход.ЦенаРек
	|ИЗ
	|	ВТ_Выход КАК ВТ_Выход
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрАкция10.Остатки(&Период, индкод В
	|			(ВЫБРАТЬ
	|				Т.Партия
	|			ИЗ
	|				ВТ_Выход КАК Т)) КАК РегистрАкция10Остатки
	|		ПО ВТ_Выход.Партия = РегистрАкция10Остатки.индкод";

Запрос.УстановитьПараметр("Ссылка", Ссылка);
Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());

РезультатЗапроса = Запрос.Выполнить();
ВыборкаТовары = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаТовары.Следующий() Цикл
			 Дефицит = ВыборкаТовары.Количество - ВыборкаТовары.КолвоОстаток;
	       
			Если Дефицит>0 Тогда
	            Отказ = Истина;
	            Сообщение = Новый СообщениеПользователю;
	            Сообщение.Текст = "Номенклатура: "+ВыборкаТовары.Номенклатура + " Партия: " + ВыборкаТовары.Партия + " недостаточно в количестве "+Дефицит+" шт.";
	            Сообщение.Сообщить();
	        КонецЕсли;
	       
	        //  Переход в начало цикла, если были ошибки
	        Если Отказ Тогда
	            Продолжить;
	        КонецЕсли;
	       
	        //  Выполнение движений в регистры
	
				Движение			 = Движения.РегистрАкция10.ДобавитьРасход();
				Движение.Период		 = ТекущаяДатаСеанса();
				Движение.Товар		 = ВыборкаТовары.Номенклатура;
				Движение.индкод		 = ВыборкаТовары.Партия;
				Движение.Склад		 = ВыборкаТовары.Склад;
				Движение.машина		 = ВыборкаТовары.машина;
				Движение.Колво		 = ВыборкаТовары.Количество;
				Движение.Цена		 = ВыборкаТовары.ЦенаАкция; 
				Движение.ЦенаРек	 = ВыборкаТовары.ЦенаРек; 
				
				Счетчик 			 = Счетчик + 1; 
	    КонецЦикла;

	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "Успех, убрали из акции: "+Счетчик+" ед. товаров."; 
	Сообщение.Сообщить();

//======================================================================================================================
КонецПроцедуры
